<a href="https://colab.research.google.com/github/RDE0509/mycodes/blob/main/Spark_joints.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
pip install pyspark

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pyspark
  Downloading pyspark-3.3.1.tar.gz (281.4 MB)
     |████████████████████████████████| 281.4 MB 37 kB/s
Collecting py4j==0.10.9.5
  Downloading py4j-0.10.9.5-py2.py3-none-any.whl (199 kB)
     |████████████████████████████████| 199 kB 29.2 MB/s
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.3.1-py2.py3-none-any.whl size=281845512 sha256=5e3dcbff6efb28778313df4a1963cc38b0abd4dd63bb8703ea647af44aa6c096
  Stored in directory: /root/.cache/pip/wheels/43/dc/11/ec201cd671da62fa9c5cc77078235e40722170ceba231d7598
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.5 pyspark-3.3.1

In [26]:
from pyspark.sql import SparkSession
from pyspark.sql import functions
from pyspark.sql.functions import *

In [11]:
spark= SparkSession.builder.appName("test").getOrCreate()

In [5]:
data = [["1", "sravan", "company 1"],
        ["2", "ojaswi", "company 1"], 
        ["3", "rohith", "company 2"],
        ["4", "sridevi", "company 1"], 
        ["5", "bobby", "company 1"]]

In [30]:
columns = ['ID1', 'NAME', 'Company']

# New Section

In [31]:
df = spark.createDataFrame(data=data,schema=columns)

In [32]:
df.show()

+---+-------+---------+
|ID1|   NAME|  Company|
+---+-------+---------+
|  1| sravan|company 1|
|  2| ojaswi|company 1|
|  3| rohith|company 2|
|  4|sridevi|company 1|
|  5|  bobby|company 1|
+---+-------+---------+

In [33]:
data1 = [["1", "45000", "IT"],
         ["2", "145000", "Manager"],
         ["6", "45000", "HR"],
         ["5", "34000", "Sales"]]

In [34]:
columns1 = ['ID', 'salary', 'department']

In [36]:
df1 = spark.createDataFrame(data1,columns1)

In [35]:
df1.show()

+---+------+----------+
| ID|salary|department|
+---+------+----------+
|  1| 45000|        IT|
|  2|145000|   Manager|
|  6| 45000|        HR|
|  5| 34000|     Sales|
+---+------+----------+

In [37]:
df3 = df.join(df1)

In [38]:
df3.show()

+---+-------+---------+---+------+----------+
|ID1|   NAME|  Company| ID|salary|department|
+---+-------+---------+---+------+----------+
|  1| sravan|company 1|  1| 45000|        IT|
|  1| sravan|company 1|  2|145000|   Manager|
|  2| ojaswi|company 1|  1| 45000|        IT|
|  2| ojaswi|company 1|  2|145000|   Manager|
|  1| sravan|company 1|  6| 45000|        HR|
|  1| sravan|company 1|  5| 34000|     Sales|
|  2| ojaswi|company 1|  6| 45000|        HR|
|  2| ojaswi|company 1|  5| 34000|     Sales|
|  3| rohith|company 2|  1| 45000|        IT|
|  3| rohith|company 2|  2|145000|   Manager|
|  4|sridevi|company 1|  1| 45000|        IT|
|  4|sridevi|company 1|  2|145000|   Manager|
|  5|  bobby|company 1|  1| 45000|        IT|
|  5|  bobby|company 1|  2|145000|   Manager|
|  3| rohith|company 2|  6| 45000|        HR|
|  3| rohith|company 2|  5| 34000|     Sales|
|  4|sridevi|company 1|  6| 45000|        HR|
|  4|sridevi|company 1|  5| 34000|     Sales|
|  5|  bobby|company 1|  6| 45000|        HR|
|  5|  bobby|company 1|  5| 34000|     Sales|
+---+-------+---------+---+------+----------+

In [39]:
df3.select('ID',"NAME","Company",'department').show()

+---+-------+---------+----------+
| ID|   NAME|  Company|department|
+---+-------+---------+----------+
|  1| sravan|company 1|        IT|
|  2| sravan|company 1|   Manager|
|  1| ojaswi|company 1|        IT|
|  2| ojaswi|company 1|   Manager|
|  6| sravan|company 1|        HR|
|  5| sravan|company 1|     Sales|
|  6| ojaswi|company 1|        HR|
|  5| ojaswi|company 1|     Sales|
|  1| rohith|company 2|        IT|
|  2| rohith|company 2|   Manager|
|  1|sridevi|company 1|        IT|
|  2|sridevi|company 1|   Manager|
|  1|  bobby|company 1|        IT|
|  2|  bobby|company 1|   Manager|
|  6| rohith|company 2|        HR|
|  5| rohith|company 2|     Sales|
|  6|sridevi|company 1|        HR|
|  5|sridevi|company 1|     Sales|
|  6|  bobby|company 1|        HR|
|  5|  bobby|company 1|     Sales|
+---+-------+---------+----------+

In [ ]:
df3.count()

20

In [41]:
df.join(df1,df.ID1==df1.ID).show()

+---+------+---------+---+------+----------+
|ID1|  NAME|  Company| ID|salary|department|
+---+------+---------+---+------+----------+
|  1|sravan|company 1|  1| 45000|        IT|
|  2|ojaswi|company 1|  2|145000|   Manager|
|  5| bobby|company 1|  5| 34000|     Sales|
+---+------+---------+---+------+----------+

In [42]:
df.join(df1,df.ID1==df1.ID,'left').show()

+---+-------+---------+----+------+----------+
|ID1|   NAME|  Company|  ID|salary|department|
+---+-------+---------+----+------+----------+
|  1| sravan|company 1|   1| 45000|        IT|
|  2| ojaswi|company 1|   2|145000|   Manager|
|  3| rohith|company 2|null|  null|      null|
|  5|  bobby|company 1|   5| 34000|     Sales|
|  4|sridevi|company 1|null|  null|      null|
+---+-------+---------+----+------+----------+

In [43]:
df.join(df1,df.ID1==df1.ID,'right').show()

+----+------+---------+---+------+----------+
| ID1|  NAME|  Company| ID|salary|department|
+----+------+---------+---+------+----------+
|   1|sravan|company 1|  1| 45000|        IT|
|   2|ojaswi|company 1|  2|145000|   Manager|
|   5| bobby|company 1|  5| 34000|     Sales|
|null|  null|     null|  6| 45000|        HR|
+----+------+---------+---+------+----------+

In [44]:
df.join(df1,df.ID1==df1.ID,'outer').show()

+----+-------+---------+----+------+----------+
| ID1|   NAME|  Company|  ID|salary|department|
+----+-------+---------+----+------+----------+
|   1| sravan|company 1|   1| 45000|        IT|
|   2| ojaswi|company 1|   2|145000|   Manager|
|   3| rohith|company 2|null|  null|      null|
|   4|sridevi|company 1|null|  null|      null|
|   5|  bobby|company 1|   5| 34000|     Sales|
|null|   null|     null|   6| 45000|        HR|
+----+-------+---------+----+------+----------+

In [45]:
df.join(df1,df.ID1==df1.ID,'fullouter').show()

+----+-------+---------+----+------+----------+
| ID1|   NAME|  Company|  ID|salary|department|
+----+-------+---------+----+------+----------+
|   1| sravan|company 1|   1| 45000|        IT|
|   2| ojaswi|company 1|   2|145000|   Manager|
|   3| rohith|company 2|null|  null|      null|
|   4|sridevi|company 1|null|  null|      null|
|   5|  bobby|company 1|   5| 34000|     Sales|
|null|   null|     null|   6| 45000|        HR|
+----+-------+---------+----+------+----------+

In [46]:
df.join(df1,df.ID1==df1.ID,'full').show()

+----+-------+---------+----+------+----------+
| ID1|   NAME|  Company|  ID|salary|department|
+----+-------+---------+----+------+----------+
|   1| sravan|company 1|   1| 45000|        IT|
|   2| ojaswi|company 1|   2|145000|   Manager|
|   3| rohith|company 2|null|  null|      null|
|   4|sridevi|company 1|null|  null|      null|
|   5|  bobby|company 1|   5| 34000|     Sales|
|null|   null|     null|   6| 45000|        HR|
+----+-------+---------+----+------+----------+

In [47]:
df.join(df1,df.ID1==df1.ID,'cross').show()

+---+------+---------+---+------+----------+
|ID1|  NAME|  Company| ID|salary|department|
+---+------+---------+---+------+----------+
|  1|sravan|company 1|  1| 45000|        IT|
|  2|ojaswi|company 1|  2|145000|   Manager|
|  5| bobby|company 1|  5| 34000|     Sales|
+---+------+---------+---+------+----------+

In [48]:
df.join(df1,df.ID1==df1.ID,'semi').show()

+---+------+---------+
|ID1|  NAME|  Company|
+---+------+---------+
|  1|sravan|company 1|
|  2|ojaswi|company 1|
|  5| bobby|company 1|
+---+------+---------+

In [50]:
df.join(df1,df.ID1==df1.ID,'left_anti').show()

+---+-------+---------+
|ID1|   NAME|  Company|
+---+-------+---------+
|  3| rohith|company 2|
|  4|sridevi|company 1|
+---+-------+---------+

In [51]:
df.show()

+---+-------+---------+
|ID1|   NAME|  Company|
+---+-------+---------+
|  1| sravan|company 1|
|  2| ojaswi|company 1|
|  3| rohith|company 2|
|  4|sridevi|company 1|
|  5|  bobby|company 1|
+---+-------+---------+

In [52]:
df1.show()

+---+------+----------+
| ID|salary|department|
+---+------+----------+
|  1| 45000|        IT|
|  2|145000|   Manager|
|  6| 45000|        HR|
|  5| 34000|     Sales|
+---+------+----------+

In [55]:
df.join(df1,df.ID1==df1.ID,'right_outer').show()

+----+------+---------+---+------+----------+
| ID1|  NAME|  Company| ID|salary|department|
+----+------+---------+---+------+----------+
|   1|sravan|company 1|  1| 45000|        IT|
|   2|ojaswi|company 1|  2|145000|   Manager|
|   5| bobby|company 1|  5| 34000|     Sales|
|null|  null|     null|  6| 45000|        HR|
+----+------+---------+---+------+----------+